import streamlit as st
import streamlit.components.v1 as components

#################################################################################################################################
# 웹 앱 환경설정
#================================================================================================================================
st.set_page_config(
    page_title="봄꽃 가요제 신청서",
    layout="wide"
)
#################################################################################################################################
# 아이프레임 생성 - st.components.v1.iframe을 사용하여 웹 앱을 아이프레임으로 임베드
#================================================================================================================================
components.iframe("https://script.google.com/macros/s/AKfycby3-cjoD0IsY0Qxjf4nDmQBqRHeQZA3CpU9Vem2gnwcpDu8T7B2vuiw_lgq9tytegZu/exec", width=None, height=560, scrolling=True)